[
  {
    "url": "https://owenberesford.me.uk/resource/architecture",
    "desc": "Notes from a course presented by T Gilb, an Agile coach, on Architectures &amp; engineering tools in an Agile environment.  This article attempts to push an important and vast set of ideas and processes into text.",
    "title": "Agile Architectures",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/reactive-architecture",
    "desc": "Notes about how to make code more resilient and also Message driven. There a variety of options for reactive systems.",
    "title": "Reactive Architecture",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/css-organisation",
    "desc": "When writing reusable UI components, ideas for how to manage CSS in them.  Most Apps will be built with a CSS framework, and this should be leveraged.",
    "title": "CSS organisation",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/architectures-for-css",
    "desc": "A review of different ways to assemble CSS, along with a description of methodologies.  With modern apps and tools, good management of CSS is essential.   There are 5 code layouts, and 9 architectures compared.",
    "title": "Architectures CSS",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/design-patterns",
    "desc": "PHP design patterns and Structures that I apply &amp; use are analysed in this article. I list over 18 Patterns I use.  Content is evergreen.",
    "title": "Design Patterns",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/risk",
    "desc": "A thorough look at the risk factor.  Im examining risk factors from a software engineering perspective, describing it and how to manage it.   Are also addressed within the risk element in software engineering.",
    "title": "Review on Risk",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/improving-search-utility",
    "desc": "A website should be written to support an audience or customers; many people use search tools to add themselves to that audience.  This article describes a categorisation scheme for your audiences.",
    "title": "Search utility",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/word-filtering",
    "desc": "On text cleaning, and the algorithms necessary. Within the context of word filtering; I look at goals, requirements, and one example. I analyse the notion of word filtering also during the practice in 2012.",
    "title": "Word filtering",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/festivals-2010",
    "desc": "Project management for 6 festivals in 12 months, detailed one year planning and cost control. My festival holidays in 2010 are an example of project planning.   This is obviously personal, but was a well organised project.",
    "title": "Festivals 2010",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/justify-oop",
    "desc": "Commercial justification for using common engineering practice of OO.  Best practices of OOP, for a business person. Business &amp; developer benefits of OOP are highlighted, along with adoption requirements.",
    "title": "The economic and commercial justification for OOP",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/reach-skin",
    "desc": "Discussion on my process of moving a maximum compatibility shell to a more user focussed shell. Objectives for the site and improvements carried out. A discussion about layout is also included in terms of boundaries, colouration, etc.",
    "title": "New skin for OB ~ 2013",
    "auth": "Owen Beresford",
    "date": 1744726008
  },
  {
    "url": "https://owenberesford.me.uk/resource/why-mongo",
    "desc": "Why use mongoDB (or NoSQL)?  Because of documentation. The article also concisely looks at a list of pros and cons about using a NoSQL system.",
    "title": "Why MongoDB?",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/non-sql",
    "desc": "Notes for a meeting, regarding non-relational structures.  A list of 10 data storage tools other than RDB, updated in 2023.  The article covers architecture and algorithms.",
    "title": "Non-SQL data storage",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/table-schema",
    "desc": "A concise reference article on how to port tables between DB systems / installations for singular use. It looks at tools that allow best control.",
    "title": "Show create table",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/scaling-mongo",
    "desc": "Analysis: how does MongoDB perform with large scale data? Limits and data modeling on practical upper data-volume for MongoDB with normal hardware. MongoDB is also compared with other data systems.",
    "title": "Creating a large scale MongoDB",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/drupal-notes",
    "desc": "Drupal 7 was discontinued in Aug 2022. This older article looks at the Drupal 7, the audience it was built for along with a comparison to other CMS at the time.",
    "title": "Drupal 7.",
    "auth": "Owen Beresford",
    "date": 1743748399
  },
  {
    "url": "https://owenberesford.me.uk/resource/symfony-usage",
    "desc": "A summary of what I did with the Symfony2+ platform and stack in around 2014. This older text lists features of Symfony2+ I used back then while working as a Symfony specialist.",
    "title": "Symfony2+ Usage",
    "auth": "Owen Beresford",
    "date": 1743748399
  }
]