[{"url":"https://en.wikipedia.org/wiki/Bridge_pattern","descrip":"Bridge pattern - Wikipedia","title":"Bridge pattern - Wikipedia","auth":"Wikipedia contributors","date":0},{"url":"https://nakedsecurity.sophos.com/2013/09/27/how-to-avoid-being-one-of-the-73-of-wordpress-sites-vulnerable-to-attack/","descrip":"Researchers have concluded that 73% of the 40,000 most popular websites that use WordPress software are vulnerable to attack. But they admit they might be wrong. Even so, they still highlight an important security issue which isnt diminished one iota by their sketchiness.","title":"How to avoid being one of the &ldquo;73%&rdquo; of WordPress sites vulnerable to attack &ndash; Naked Security","auth":"","date":0},{"url":"https://www.phpmyadmin.net/security/","descrip":"phpMyAdmin - Security","title":"phpMyAdmin - Security","auth":"phpMyAdmin contributors","date":0},{"url":"https://stackoverflow.com/questions/2631269/how-to-secure-phpmyadmin","descrip":"php - How to secure phpMyAdmin - Stack Overflow","title":"php - How to secure phpMyAdmin - Stack Overflow","auth":"No author for Q&amp;A sites","date":0},{"url":"https://moz.com/blog/the-definitive-guide-to-wordpress-security","descrip":"Working on a WordPress site comes with its own set of security vulnerabilities, and the more you know, the safer your site will be. With custom code to block intrusion attempts and boatloads of additional resources, this is your guide to thwarting any would-be attackers.","title":"The Definitive Guide to WordPress Security - Moz","auth":"@Moz","date":0},{"url":"https://www.whitefirdesign.com/blog/2014/12/16/security-vulnerability-fixes-often-left-unmentioned-in-wordpress-plugin-changelogs/","descrip":"Security Vulnerability Fixes Often Left Unmentioned In WordPress Plugin Changelogs | White Fir Design Blog","title":"Security Vulnerability Fixes Often Left Unmentioned In WordPress Plugin Changelogs | White Fir Design Blog","auth":"","date":0},{"url":"https://wordpress.org/about/security/","descrip":"Why is WordPress recommended as a secure website-building solution? With a passionate open source community and an extensible, easy-to-use platform, WordPress provides flexible and secure options for all levels of users, from beginners to pros. Learn how WordPress guarantees the security of 43% of the web.","title":"Security | WordPress.org","auth":"unknown","date":0},{"url":"https://premium.wpmudev.org/blog/wordpress-security-exploits/","descrip":"As one of the most high-profile open-source software projects, WordPress has been a natural target for ongoing security exploits. In this article, we&rsquo;ll cover a selection of the major WordPress security exploits to date and what they meant for both users like you and the future of WordPress.","title":"The History of WordPress Security Exploits and What They Mean","auth":"","date":0},{"url":"https://www.wordfence.com/learn/how-to-protect-yourself-from-wordpress-security-issues/","descrip":"Learn who is hacking WordPress sites, why hackers attack sites, and how to protect your website. This is a basic introduction to WordPress security.","title":"How to Protect Yourself from WordPress Security Issues &amp; Threats","auth":"","date":0}]